pruebas/results/2025-11-10_17-24-38/S2_3_proxy_rw_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 88.78 qps: 1777.52 (r/w/o: 1244.66/355.10/177.75) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 83.20 qps: 1664.87 (r/w/o: 1165.65/332.81/166.41) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 85.00 qps: 1699.77 (r/w/o: 1189.78/339.99/170.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 85.00 qps: 1700.61 (r/w/o: 1190.41/340.20/170.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 85.80 qps: 1716.58 (r/w/o: 1201.18/343.80/171.60) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 82.20 qps: 1642.31 (r/w/o: 1149.93/327.98/164.39) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 85.21 qps: 1705.71 (r/w/o: 1193.67/341.62/170.41) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 84.40 qps: 1686.39 (r/w/o: 1180.80/336.80/168.80) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 76.00 qps: 1521.39 (r/w/o: 1064.80/304.60/152.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 84.40 qps: 1684.59 (r/w/o: 1178.79/337.00/168.80) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 82.00 qps: 1642.81 (r/w/o: 1150.81/328.00/164.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 83.80 qps: 1674.41 (r/w/o: 1171.61/335.20/167.60) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            70420
        write:                           20120
        other:                           10060
        total:                           100600
    transactions:                        5030   (83.81 per sec.)
    queries:                             100600 (1676.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0178s
    total number of events:              5030

Latency (ms):
         min:                                    7.46
         avg:                                   11.93
         max:                                  440.73
         95th percentile:                       22.69
         sum:                                60000.78

Threads fairness:
    events (avg/stddev):           5030.0000/0.00
    execution time (avg/stddev):   60.0008/0.00