pruebas/results/2025-11-10_17-24-38/S2_3_proxy_rw_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 201.52 qps: 4053.88 (r/w/o: 2841.53/807.70/404.65) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 200.62 qps: 4006.29 (r/w/o: 2803.75/801.30/401.25) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 204.40 qps: 4098.55 (r/w/o: 2867.56/822.19/408.79) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 205.20 qps: 4097.62 (r/w/o: 2868.01/819.20/410.40) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 203.59 qps: 4065.37 (r/w/o: 2846.84/811.35/407.18) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 198.80 qps: 3978.19 (r/w/o: 2784.59/796.00/397.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 204.60 qps: 4089.86 (r/w/o: 2863.24/817.41/409.21) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 207.60 qps: 4151.60 (r/w/o: 2904.80/831.80/415.00) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 200.40 qps: 4016.55 (r/w/o: 2811.57/803.99/401.00) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 207.40 qps: 4136.80 (r/w/o: 2896.40/825.60/414.80) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 201.61 qps: 4034.84 (r/w/o: 2824.97/806.65/403.22) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 202.59 qps: 4051.50 (r/w/o: 2834.79/811.54/405.17) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            170800
        write:                           48800
        other:                           24400
        total:                           244000
    transactions:                        12200  (203.12 per sec.)
    queries:                             244000 (4062.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0621s
    total number of events:              12200

Latency (ms):
         min:                                    9.38
         avg:                                   39.36
         max:                                  134.14
         95th percentile:                       86.00
         sum:                               480212.73

Threads fairness:
    events (avg/stddev):           1525.0000/121.06
    execution time (avg/stddev):   60.0266/0.02